OpenFOAM-v1712/tutorials/multiphase/interDyMFoam/RAS/motorBike/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 5;

method          hierarchical;
// method          ptscotch;

// Optional decomposition constraints
constraints
{
    refinementHistory
    {
        //- Decompose cells such that all cell originating from single cell
        //  end up on same processor
        type    refinementHistory;
    }
}


coeffs
{
    n           (5 1 1);
    //delta       0.001; // default=0.001
    //order       xyz;   // default=xzy
    dataFile    "cellDecomposition";
}


// ************************************************************************* //
